## Определение персонажей
define n = Character('Никола Зелин', color="#e0d03d")
define g = Character('Гаррет Морган', color="#15861b")
define jo = Character('Джо Вербелл', color="#cc6927")
define jz = Character('Йозеф Вопер', color="#7a829b")
define v = Character('Вернер Бауманн', color="#86281c")
define h = Character('Хельмут Борген', color="#68b7d6")
define x = Character('...', color="#ffffff")

## Определения стандартных параметров для мини-игры
define puzzle_field_size = 650
define puzzle_field_offset_x = 675
define puzzle_field_offset_y = 200
define puzzle_piece_size = 450
define grip_size = 75
define active_area_size = puzzle_piece_size - (grip_size * 2)

## Определение звуков
define audio.scream = "audio/scream.mp3"
define audio.tummy = "audio/tummy.mp3"
define audio.door = "audio/door.mp3"
define audio.fall = "audio/fall.mp3"
define audio.lock = "audio/lock.mp3"
define audio.finger = "audio/finger.mp3"

## Определение изображений
image Nicola normal = "images/sprites/Nicola Normal.png"
image Nicola dark ="images/sprites/Nicola dark.png"
image Joe normal = "images/sprites/Joe normal.png"
image Joe dark = "images/sprites/Joe dark.png"
image Jozeph normal = "images/sprites/Jozeph normal.png"
image Jozeph dark = "images/sprites/Jozeph dark.png"
image Jozeph normal1 = "images/sprites/Jozeph normal 1.png"
image Jozeph dark1 = "images/sprites/Jozeph dark 1.png"
image Verner normal = "images/sprites/Verner normal.png"
image Verner dark = "images/sprites/Verner dark.png"
image Helmut normal = "images/sprites/Helmut normal.png"
image Helmut dark = "images/sprites/Helmut dark.png"
image Soldier normal = "images/sprites/Soldier normal.png"
image Children = "images/sprites/Children.png"

## Начало игрового скрипта
label start:
    stop music
    scene black with Fade(2, 0.5, 1)
    x "Враги отступают! Ещё немного и Асловец будет за нами!"
    x "Во славу Болимвера!"
    "*боевые крики солдат*"

    scene war with Fade(0.5, 1, 1)

    '''
    Воодушевлённые солдаты Болимвера всё дальше продвигались к крепости Асловец по кровавым следам павших врагов.
    
    Их торжественные крики разносились по всему полю боя, перекрывая собой звуки взрыва снарядов.
    
    Молодой паромедик, с белой повязкой на руке, аккуратно перебинтовывает раненных солдат.
    
    В их глазах совсем нет отчаяния, они смеются и что-то весело обсуждают.
    
    Зёленый пар обволакивает их израненные тела, и кровь мгновенно перестаёт течь.
    
    Паромедик берёт другую пробирку, и цвет пара сменяется на бирюзовый.
    
    Выражение лиц солдат на некоторое время меняется, кажется, что им не очень приятна эта процедура, они ощущают покалывание по всему телу.
    
    Перебинтованные только что солдаты понимают, что их отправят в лазарет, но далеко не всем это по душе.

    Многие из них хотят продолжить бой, даже те, кто потерял одну или несколько конечностей.
    
    Те, кто мог сопротивляться, вскакивали с расстеленных на землю простыней и бежали прямо линию фронта и никто не мог их остановить.

    Я видел сотни подобных солдат, порой они умирали в первые минуты после перевязки от своей собственной гордыни.
    
    Открывшиеся вновь раны начинали кровоточить ещё сильнее, но они как будто этого даже не замечали.

    Вернувшись в лазарет, я заметил, как из-за крепости Асловец начало появляться густое фиолетовое облако.
    
    Что-то мне подсказывало, что это не сулит ничего хорошего.
    '''
    play sound scream volume 0.5
    pause 2.5
    scene lab

    '''
    Внезапный крик вывел меня из сна.

    В холодном поту я не мог понять, откуда доносился этот крик, то ли во сне, то ли наяву.

    Я окончательно проснулся и осмотрелся.

    Я всё также находился в своей лаборатории в госпитале совершенно один.

    Здесь вечно царит мрачная обстановка, единственный источник света в комнате, это масляная лампа на моём столе.

    Заколоченные окна и запах сырости смешавшийся с реагентами на моём столе придают этому месту неуютность.

    '''

    play sound tummy
    pause 2.5

    g "Кажется, я не ел с прошлого дня" 
    '''
    Мои последние запасы еды давно закончились.

    Единственное что я сейчас могу сделать, это использовать пар собственной разработки.

    Пар временного насыщения или сокращённо ПВН. Старая треснутая пробирка с оранжевой мутной жидкостью.

    Состоит из дрожжей и стружки грецкого ореха в правильном соотношении.

    Но в основе лежат не они, а цветок Эдем, а точнее его стебель, размолотый заранее.

    Получившийся в дальнейшем из этой жидкости пар оказывает долговременное воздействие, придающее ощущение сытости человеку вдохнувшему его.

    Из неприятного, это негативные последствия, появляющиеся позже, такие как: тошнота, рвота и усиление голода.

    На некоторое время мне этого хватит, но нужно обзавестись и обычной едой.

    Торговцы бывают здесь достаточно часто в отличие от разрушенной некогда столице Бомливера.

    '''

    scene lab
    with fade

    "Обучение" "Мини-игра представляет собой пазлы."
    "Обучение" "Вы должны перетаскивать куски пазла в поле на нужные места."
    "Обучение" "Учтите, что сложность пазла может возрастать по ходу сюжета."
    "Обучение" "Если пазл покажется сложным, у вас есть возможность его пропустить."

    scene black with fade
    centered "Создаём пазл...{nw}"
    $ grid_width = 4
    $ grid_height = 4
    $ chosen_img = "minigame/minigame1.png"

    call puzzle from _call_puzzle
    
    scene lab with fade

    play sound door
    pause 2.3

    g "Заходите в прихожую и обязательно закройте за собой дверь, ждите моих дальнейших указаний."
    g "Смотрите на парометр, когда значение будет равно 1013 гектопаскалей, вы можете снять свой противопар и защитный костюм, затем войти."

    show Nicola dark with fade

    "Через некоторое время в комнату вошёл мужчина примерно моих годов, низкого роста с короткой причёской, в круглых очках, одет в столичный костюм."

    menu:
        "Здравствуйте":
            show Nicola normal
            x "Здравствуйте? Серьёзно? Делаешь вид что мы незнакомы?"
        "А, это ты":
            show Nicola normal
            x "Неужели тебе всё равно что я пришёл?"
        "Чего пришёл?":
            show Nicola normal
            x "Ты бы хоть поздоровался для начала"

    x "Какой-то ты недружелюбный, Гарретт."

    show Nicola dark

    "Это Никола Зелин, он когда-то вместе со мной воевал на фронте за Болимвер."

    show Nicola normal

    n "Я пришёл тебя проведать и сказать, что торговец будет в нашей главной лаборатории после обеда."

    show Nicola dark

    menu:
        "Это всё? Проваливай отсюда.":
            show Nicola normal
            n "Кажется ты впринципе недоволен тем что я к тебе пришёл."
        "Хорошо, спасибо.":
            pass

    show Nicola normal

    n "Это ещё не всё. Я показал главному учёному твою разработку, как ты там его называешь?{w} А, точно, ПВН."
    n "Ему очень понравилась концепция утоления голода с помощью пара."

    show Nicola dark
    
    g "Вообще-то этот пар лишь придаёт ощущение сытости на непродолжительное время."
    g "К тому же по окончании действия имеет очень неприятные последствия."

    show Nicola normal

    n "Да это всё ерунда{w}. В нашей лаборатории стоят самые современные технологии, а также мы предоставляем лучшие материалы для изготовления паровой жидкости."
    n "Если ты устроишься к нам, то без труда сможешь доработать не только эту жидкость, но и всё остальное что у тебя хранится здесь."

    show Nicola dark

    menu:
        "Спасибо, но, пожалуй, откажусь":
            show Nicola normal
            n "Ты упускаешь такую замечательную возможность, Гаррет"
        "Мне и здесь нормально":
            show Nicola normal
            n "Ты ничего не меняешь в своей жизни уже много лет"
        "Не лезь в мои дела":
            show Nicola normal
            n "Я пытаюсь тебе помочь, Гаррет"

    n "Знаешь{w}, я бывал здесь уже много раз."
    n "Разбитые пробирки, заколоченные окна, даже трубка, которую ты используешь, уже давно несовершенна."
    n "Ты и сам понимаешь, что в ней скапливаются остатки всех жидкостей, что ты использовал до этого."
    n "Мой дружеский совет{w}, хватит тебе уже упрямиться."
    n "Пошли уже к нам в лабораторию."
    n "Я не раз замаливал за тебя словечко, они примут такого как ты хоть сейчас!"

    show Nicola dark

    menu:
        "Я уже сказал что мне и здесь хорошо":
            show Nicola normal
            n "Хотя бы дослушай меня!"
        "Когда ты уже уйдёшь":
            show Nicola normal
            n "Вот значит как{w}, хорошо, Гаррет"
            n "Оставайся здесь и дальше, мне всё равно"
            $ newantivapor = False
            hide Nicola with fade
            jump nicolaleave
    
    show Nicola normal

    n "Я уже устал таскать тебе отбракованные стебли Эдема."
    n "Что ты будешь делать без главного реагента?"
    n "Пойми, война давно закончилась, надо жить дальше."
    n "Пока ты здесь чахнешь в своём сарае, я завёл себе семью, живу прямо в безопасном секторе лаборатории."
    n "Я получаю хорошую зарплату, иногда меня даже приглашают на конференции в столицу, как перспективного учёного."

    show Nicola dark

    menu:
        "Я не хочу находиться рядом с этими чинушами":
            pass
        "Я не хочу находиться рядом с этими убийцами":
            pass
        "Мне некомфортно находиться в этой атмосфере":
            pass
    
    show Nicola normal

    n "Пойми, не ты один хочешь найти способ избавиться от фиолетовой смерти!"
    n "В нашей лаборатории мы также работаем и над этим!"
    n "Гениальный ученый Фредерик Гатри создал паробарьер, который работает над столицей."
    n "Я надеюсь, что наши разработки помогут создать такой же паробарьер и на этих землях."

    show Nicola dark

    menu:
        "Я не хочу работать с людьми, которые начали эту войну":
            pass
        "Я не хочу работать с людьми, которые создали фиолетовую смерть":
            pass

    show Nicola normal

    n "Ты считаешь, что Болимвер был никак к этому не причастен?"
    n "Это они создали фиолетовую смерть, и этому есть прямые доказательства!"
    n "Просто пойми, что мы подчинялись приказам людей, которые были ответственны за это с самого начала."

    show Nicola dark

    menu:
        "Это все неправда, ты ведь и сам понимаешь":
            pass
        "Ты так изменился после войны":
            show Nicola normal
            n "Всё, закрыли тему!"
    
    show Nicola normal

    n "Я пришёл сюда не спорить о минувших годах, а сообщить важные новости."
    n "Меня скоро переводят в столицу, я больше не смогу приносить тебе реагенты и стебли Эдема."
    n "Можешь и дальше оставаться здесь, но я советую тебе перебраться к нам."

    show Nicola dark

    menu:
        "Ладно, ладно, учту":
            show Nicola normal
            n "Надеюсь хоть в этот раз ты меня послушаешь"
        "Я тебе уже всё сказал":
            show Nicola normal
            n "Надеюсь мои слова значат для тебя хоть что-то"

    n "Это мой прощальный подарок тебе{w}, отдаю свой запасной противопар."
    $ newantivapor = True
    n "Надеюсь, ты сможешь выжить в этом мире со своими старыми идеалами."
    n "Подумай о том, что я тебе сказал{w}, прощай."

    hide Nicola normal with fade

label nicolaleave:
    "С видимым негодованием на лице он поспешно удалился из моей лаборатории."
    "Я и подумать не мог, что ему так промыли мозги{w}. Только настолько прогнившее государство как Иприт может так сильно повлиять на человека."
    "Но почему он так сильно заботится обо мне?"
    "Видимо в нём ещё осталась крупица хоть какой-то человечности."
    "Время на паровых часах близится к обеду."

    if newantivapor:
        "Скоро нужно будет собираться выходить, заодно опробую противопар что он мне оставил напоследок."

    "После войны деньги практически обесценились вне столицы, что привело к бартерной системе."
    "Деньгами не насытишься{w}. Мне нужно что-то приготовить для продажи."
    "Различные пары с негативными эффектами очень сложно продать."
    "Зачастую они больше интересуют ученых, нежели простое население."
    "Лечебный пар будет лучшим выбором в подобной ситуации."
    "Конечно, он не может лечить смертельные раны, но уж точно работает лучше, чем простые антибиотики."

    scene black with fade
    centered "Создаём пазл...{nw}"
    $ grid_width = 5
    $ grid_height = 5
    $ chosen_img = "minigame/minigame2.png"

    call puzzle from _call_puzzle_1
    scene lab with fade

    g "Отлично,{w} то что нужно"

    """
    Хоть я и использую реагенты низкого качества, этого пара будет достаточно для залечивания мелких ран и болезней.

    Перед уходом главное ничего не забыть, потому что возвращаться придётся долго.

    Для выхода на улицу необходим защитный костюм и противопар.

    Фиолетовая смерть сейчас является основой всей атмосферы.

    Контакт с паром вызывает множественные покраснения и жжение кожи в незащищённых местах, вплоть до кровотечения.

    При попадании внутрь пар оказывает сильное воздействие на дыхательные пути.

    Степень повреждения зависит от продолжительности нахождения в прямом контакте с атмосферой.

    Это в дальнейшем может вызвать болезни лёгких, тошноту, головокружение, слепоту и повреждение внутренних органов с последующей смертью.
    """

    g "Пора выходить"

    scene black
    with fade

    """
    Плотно закрыв за собой дверь в прихожей, я надеваю сначала костюм, затем противопар.

    Я медленно открываю входную дверь.

    Тут же клубы фиолетового пара заполняют всё пространство.

    Этот пар имеет невысокую плотностью, поэтому видимость может быть сравнима с небольшим туманом.

    Я выхожу из прихожей.
    """
    scene village
    with Fade(0.5, 0.5, 2)

    """
    Окончательно выйдя из госпиталя передо мной предстал вид разрушенной деревни, где некогда кипела жизнь.

    Полуразрушенные дома с заколоченными или выбитыми окнами.

    Едва различимые дороги, и эта кроваво-красная пелена перед глазами.

    Кажется, будто только вчера фиолетовая смерть охватила всё вокруг.

    Поблизости нет никаких признаков живых организмов.

    Пробираясь сквозь фиолетовый туман я замечал вокруг себя до боли знакомую картину, к которой уже давно привык.

    Я до сих пор помню как люди, поглощённые паром, истошно кричали в последние минуты своей жизни.

    Для многих людей сейчас эта атмосфера стала обыденностью, но только не для меня.

    Лаборатория находится примерно в 5 километрах от деревни, но будучи в костюме и противопаре это расстояние кажется вечностью.

    Всё ближе подбираясь к месту назначения, я стал замечать звуки кашля и разговоров из близлежайших домов.
    """
    scene black with fade
    "Некоторое время спустя..."

    scene market
    with Fade(0.5, 0.5, 2)

    """
    Подойдя к площади, передо мной предстала следующая картина.

    Большая группа людей в старых противопарах толпилась у прилавков, где в основном торговали едой и лечебным паром.

    Некоторые прорывались сквозь толпу чтобы оказаться первыми у прилавков и успеть забрать хоть что-то.

    И их прекрасно можно понять.

    Все они – это взрослые мужчины, которые хоть как-то пытаются прокормить свои семьи.

    От их действий зависит, будут ли сыты их дети сегодня или нет.

    Напротив же ярко выделяются лаборанты в своих дорогих костюмах, которые подходят к прилавкам с более интересным содержанием.

    Их абсолютно не волнуют люди вокруг, которые едва сводят концы с концами.

    Бедняки на площади, оставшиеся без семьи и хоть каких-то средств на существование, просят милостыни у проходящих мимо людей.

    Только изредка прохожие дают им хоть что-то{w}. Но с каждым днём лица бедняков меняются{w}. Старые пропадают – приходят новые.

    Практически подойдя к торговым прилавкам, меня резко окружила толпа детей.
    """
    show Children
    "Дети" "Дяденька, помогите, подайте, подайте."

    """
    Внешний вид этих несчастных детей повергал меня в ужас.

    Потрёпанная одежда и свежие раны.

    Отсутствие хоть какой-то защиты от пара.

    Многие из этих детей практически ничего не видели и ориентировались только на слух.

    Мне стало очень жалко этих детей, поэтому я решил дать им одну пробирку лечебного пара, чтобы хоть как-то облегчить их страдания.
    """
    
    menu:
        "Возьмите, используйте это чтобы залечить свои раны":
            pass
        "Продайте эту пробирку и купите себе хлеба":
            pass
    
    "Дети" "Спасибо вам большое, храни вас Эдем!"
    hide Children with fade

    init:
        $ joepos = Position(xalign=0.5, yalign =-0.10)
    
    show Joe normal at joepos

    x "Кыш отсюда, мелюзга, просите милостыню где-то в другом месте"

    hide Joe

    "Дети тут же разбежались кто куда."
    "Один из торговцев крайне возмущённо на меня смотрел."

    show Joe normal at joepos

    x "Ну и зачем ты это сделал?"

    show Joe dark at joepos

    menu:
        "Не знаю, просто захотел им помочь":
            pass
        "А тебе какое дело?":
            pass
    
    show Joe normal at joepos

    x "Ты ведь и сам понимаешь, что им такого обьёма не хватит, чтобы облегчить свои страдания?"
    x "Да и к кому они пойдут? {w}Ни один торговец не предложит нормальную цену попрошайкам."
    x "На вырученные средства они вряд ли смогут купить достаточно еды для всех."

    show Joe dark at joepos

    menu:
        "А что ты можешь предложить?":
            pass
        "Почему никого не волнуют эти бедняки":
            pass
    
    show Joe normal at joepos

    x "Понимаешь{w}, после войны всё переменилось."
    x "Каждый выживает как может, ни у кого нет ничего лишнего что он мог бы отдать другому нуждающемуся."
    x "Мы все и есть нуждающиеся, просто в разной мере."

    show Joe dark at joepos

    g "Правда, суровая, но правда"

    show Joe normal at joepos

    x "Так о чём это я{w}, вижу ты располагаешь пробирками с паровой жидкостью."
    x "Думаю мы найдём с тобой общий язык."
    jo "Мне надо представиться, я Джо Вербелл, торговец из столицы."
    jo "В основном скупаю паровые жидкости, а также занимаюсь перевозками, за отдельную плату само собой."

    show Joe dark at joepos

    g "В каком смысле необычными?"

    show Joe normal at joepos

    jo "Ну как сказать{w}, жидкости разных оттенков, которые не производят массово."
    jo "Ты просто не представляешь на что готовы пойти парофилы из столицы ради того, чтобы отведать необычный пар."
    jo "За различные паровые жидкости жёлтого оттенка они готовы отдать кругленькую сумму."

    show Joe dark at joepos

    g "Парофилы?{w} Не представляю как кто-то может ловить кайф от пара"

    show Joe normal at joepos

    jo "Да почти вся столица сидит на пару, это уже давно стало чем-то обыденным."
    jo "Но я что-то отвлёкся{w}, я хотел посмотреть что ты мне можешь предложить."
    jo "Пойдём за мою стойку."

    hide Joe

    "Вместе с Джо мы всё дальше отходили от прилавков с едой для горожан, углубляясь в дальние ряды."
    "Здесь продаются не только паровые жидкости, но и различная парозащита вперемешку с приспособлениями для употребления пара."

    scene track with fade

    jo "Ну вот, мы на месте, мой прилавок."
    "На самом деле это был багажник небольшого внедорожника."
    "От разнообразия жидкости здесь можно потерять голову. Различные оттенки, начиная с зелёного влоть до тёмно-красного."
    "И помимо этого различные устройства: от обычных трубок до списанных военных кадил."
    jo "Ну как тебе мой товар?"
    jo "Чего ты молчишь постоянно, такой хмурый, ей богу."

    show Joe dark at joepos

    menu:
        "Мне просто сказать нечего, вот и всё":
            pass
        "*Промолчать*":
            pause 1.5
    
    show Joe normal at joepos

    jo "Ну чего ты как неродной, давай доставай всё что у тебя есть"

    "Его оптимизм сильно контрастирует на фоне остальных людей."
    "Будто бы никакой войны и не было."
    "Я достаю свои пробирки и аккуратно кладу их на его стол..."

    play sound fall
    pause 1.0

    "Совершенно случайно из моей сумки выпадает пробирка ПВН."
    "Джо сразу же обращает на это внимание."
    "Я незамедлительно подобрал её с земли и убрал обратно."

    jo "А это что такое, такой необычный оранжевый оттенок."

    show Joe dark at joepos

    g "Это не для продажи"

    show Joe normal at joepos

    jo "Да ладно тебе, показывай давай."
    "Его настойчивость не оставляет мне другого выбора кроме как снова достать пробирку с ПВН."
    jo "Интересно, интересно."
    jo "Видно что были использованы низкокачественные реагенты, но вот приготовление на высшем уровне."
    jo "Ты случайно не тот парохимик Гарретт Морган о котором все говорят?"

    show Joe dark at joepos

    menu:
        "Да, я Гарретт Морган":
            pass
        "Все обо мне говорят? Почему?":
            pass
    
    show Joe normal at joepos

    jo "Да ладно{w}, правда что ли?"
    jo "Сегодня мне несказанно повезло наткнуться на тебя."
    jo "Мой ученик часто ездит сюда вместо меня, ты у него любимый клиент, он часто о тебе рассказывает."

    if newantivapor:
        jo "Говорит ты ходишь в каких-то лохмотьях, но по тебе сейчас и не скажешь, противопар блестит как новый."
    else:
        jo "Он очень хорошо запомнил твои лохмотья в которых ты постоянно ходишь."
    
    jo "Слушай, а что делает этот пар из оранжевой пробирки?"

    show Joe dark at joepos

    g "Я называю его ПВН – пар временного насыщения"
    g "Придаёт ощущение сытости на длительное время"

    show Joe normal at joepos

    jo "И ты сделал это сам?{w} Поразительно."
    jo "Можешь больше ничего не говорить, я и сам понимаю что после употребления следуют негативные эффекты."
    jo "Любой пар имеющий долю красного оттенка такой."
    jo "Слушай{w}, может быть ты продашь мне его?"

    show Joe dark at joepos

    g "Этот рецепт и пар я не продаю, только зелёные пробирки"

    show Joe normal at joepos

    jo "Ладно, ладно, я не настаиваю, просто ты упускаешь такую возможность, мой друг."

    show Joe dark at joepos

    g "Деньги меня не интересуют, мне нужна еда"

    show Joe normal at joepos

    jo "Тебя можно понять{w}, хорошо{w}, жди меня здесь."

    hide Joe with fade
    
    "Внезапно Джо выскакивает из-за стола и уходит в сторону прилавков торговцев продающих еду."
    "Обойдя прилавок он подошёл к торговцу и весело начал вести с ним диалог."
    "Отсюда я не мог услышать о чем они говорят, но казалось будто они как два приятеля."
    "Взяв небольшой деревянный короб Джо поспешно вернулся ко мне."

    show Joe normal at joepos

    jo "Вот, держи, думаю на неделю тебе должно хватить."

    show Joe dark at joepos

    g "Что внутри?"

    show Joe normal at joepos

    jo "Галеты, 7 упаковок за 7 пробирок{w}, думаю справедливая цена."
    jo "Только не вскрывай её здесь, она загерметизирована паром."
    jo "Откроешь её там, где уровень пара не превышает нормы."

    show Joe dark at joepos

    g "Спасибо{w}, я пойду"

    show Joe normal at joepos

    jo "Если ты всё таки передумаешь насчёт своего ПВН, милости прошу, я всегда рад тебя видеть."
    jo "Я пробуду здесь ещё пару дней, потом уеду обратно в столицу."

    show Joe dark at joepos

    menu:
        "Хорошо, я учту":
            show Joe normal at joepos
            jo "Не отказывайся от такого выгодного предложения!"
        "Ещё раз спасибо, Джо":
            show Joe normal at joepos
            jo "Заходи почаще!"
        "*Промолчать*":
            pause 1.0
    
    jo "Удачи! Ещё увидимся!"

    scene black with fade

    "Попрощавшись с Джо и взяв коробку с едой, я собирался направляться обратно в свою лабораторию."

    init:
        $ jozpos = Position(xalign=0.5, yalign=2.0)
    scene market with fade
    show Jozeph normal1 at jozpos
    
    "Мой путь преградил мужчина в дорогом лабораторном парокостюме."
    "Кажется всё это время он следил за мной пока я был здесь."
    x "Добрый день!{w} Как я понимаю вы Гарретт Морган, верно?"
    "Передо мной стоял мужчина средних лет."
    "Было видно, что он человек из лаборатории, об этом говорит логотип и его именной бейджик,{w} но с такого расстояния прочесть имя я не мог."

    menu:
        "Да, это я":
            pass
        "Что надо?":
            pass
    
    "Мужчина открыл свой деловой портфель и немного покопавшись в нем, вынул небольшую визитницу, открыв которую он достал одну из визиток и протянул мне."
    jz "Меня зовут Йозеф Вопер, я младший менеджер третьего отдела лаборатории."
    "Данные на визитке полностью совпадали с тем что он мне говорил. Помимо его имени здесь также был логотип лаборатории \"Байстимер\""
    jz "Мне было поручено лично сопроводить вас и показать лабораторию."
    jz "Наш начальник очень заинтересован вами как отличным специалистом в сфере пароварения."

    show Jozeph dark1 at jozpos

    menu:
        "Я пожалуй откажусь":
            pass
        "Я никуда не пойду":
            pass
        "Думаю можно посмотреть":
            jump Lab
    
    show Jozeph normal1 at jozpos

    jz "Гаретт, я вас очень прошу, вы не пожалеете если посетите нас."
    jz "Вы своими глазами увидите в каких условиях работают лучшие умы государства."
    jz "Возможно именно ваши разработки смогут изменить мир к лучшему."

    show Jozeph dark1 at jozpos

    g "Я уже устал слушать ваше пустословие"
    g "Новый мир, невероятные разработки и открытия.{w} Всё это – бред"

    show Jozeph normal1 at jozpos

    jz "Ну что вы, мыслите позитивно, когда-нибудь мы сможем избавить мир от фиолетовой смерти."

    show Jozeph dark1 at jozpos

    menu:
        "Если бы вы правда хотели, то давно бы от неё избавились":
            pass
        "У меня нет времени сотрясать воздух, мне нужно работать":
            pass
    
    show Jozeph normal1 at jozpos

    jz "Ну постойте, войдите в моё положение."
    jz "Что я скажу начальству с пустыми руками?"
    jz "Мне могут сделать выговор и понизить в должности,{w} а в худшем случае даже уволить."
    jz "Пожалуйста, пройдёмте со мной, это не займёт так много времени."

    show Jozeph dark1 at jozpos

    "В его голосе была заметна дрожь и обеспокоенность." 
    "Это выглядело немного странно."

    menu:
        "Мне нет дела до лабораторных крыс":
            pass
        "Мне кажется вы преувеличиваете, я пойду":
            pass
    
    show Jozeph normal1 at jozpos

    jz "Знаете, Гарретт,{w} я видел, что вы пытались помочь этим несчастным беспризорникам."
    jz "Я понимаю, что не могу силой заставить вас пойти в лабораторию, но у меня есть для вас другое предложение."
    jz "Я всегда с собой ношу парочку пробирок лечебного пара, на всякий случай."
    jz "Я могу поделиться ими с этими детьми, но тогда вы будете обязаны пойти со мной."

    show Jozeph dark1 at jozpos
    
    "На кону стояло моё упрямство, либо облегчение страданий детей. Эти крысы из Иприта пойдут на всё лишь бы достичь желаемой цели, но выбора нет."
    g "Хорошо, но сначала отдай детям пар"

    show Jozeph normal1 at jozpos

    "Йозеф радостно кивнул и мы вместе направились к группе ребят."

    hide Jozeph with fade

    "Немного покапавшись, из того же делового портфеля он достал три зелёных пробирки и протянул их детям."
    "Дети" "Спасибо вам."
    "Они вежливо поблагодарили нас и поспешно направились к другому скоплению беспризорников."
    "Ребята постарше умеют обращаться с паровой жидкостью и предпочитают держаться вместе, охраняя и наставляя младших, ведь сами они не знают, сколько им осталось."

    show Jozeph normal1 at jozpos with fade

    jz "Я свою часть сделки выполнил, {w}вас это устроит?"
    "Я лишь утвердительно покачал головой."

label Lab:

    show Jozeph normal1 at jozpos

    jz "Замечательно! Я рад что вы согласились. Следуйте за мной."

    hide Jozeph
    scene black with fade

    "Вместе с Йозефом мы прошли все торговые ряды до самого конца, подойдя прямо к воротам, выходящим из каменной стены."

    scene gates
    with fade

    """
    Вблизи кажется, что эти ворота стоят здесь очень давно, будто часть разрушенной крепости, настолько всё выглядит старым.

    Подойдя совсем вплотную, мы увидели вооружённых солдат охраняющих проходной пункт.

    Их было всего двое, но одеты они были в странные костюмы, которые я никогда раньше не видел.

    Их внешнему виду и вооружению позавидовал бы любой на войне 10 лет назад.

    Такое снаряжение не могли себе позволить даже высокопоставленные чины в те далёкие времена.

    Их внешний вид сильно контрастировал с окружением.

    Справа от ворот находилось будто небольшое окошко, в котором виднелся силуэт человека.

    Мы подошли совсем близко, в радиус видимости солдат.

    Они направили на нас оружие, после чего Йозеф незамедлительно снял бейджик и показал его им.

    Солдаты тут же опустили винтовки.

    Йозеф направился к окошку, я поспешно последовал за ним.
    """
    "Голос из окошка" "Пропуск!"

    "Пошарившись в портфеле, Йозеф вынул металлическую рифлёную пластину на который были выгравированы какие-то символы, и протянул её в окно."
    "Через некоторое время из окошка донёсся всё тот же голос."

    "Голос из окошка" "Кто с вами?"
    
    "Йозеф молча протянул небольшую бумажку с печатью охраннику."
    "Я даже не заметил откуда он её достал."

    "Голос из окошка" "Временный пропуск действует только до завтрашнего дня. Прошу не задерживаться по истечении времени."

    """
    Охранник углубился куда-то внутрь окна.

    Было слышно, что он общается с кем-то, но я не мог разобрать ни одного слова.

    По прошествии нескольких минут ворота начали гудеть и скрипеть.

    Они медленно стали отворяться перед нами, и из маленького зазора за ними тут же показалось небольшое помещение.

    Видимо в этом промежуточном помещении и происходит очистка воздуха.
    """

    scene warehouse with fade

    """
    Оказавшись внутри, мы дождались закрытия основных ворот.

    Тут же включились турбины, всасывающие загрязнённый воздух.

    Пока происходила очистка, я внимательно осматривался.

    Этот предпарник был похож больше на склад, нежели на помещение для дезинфекции.

    Различные коробки с неизвестным содержимым были слева и справа.

    Гудение турбин прекратилось довольно быстро.

    Йозеф развернулся ко мне и гордо воскликнул.
    """

    show Jozeph normal at jozpos
    
    jz "Очистка завершена!"
    jz "Можете снимать своё снаряжение."
    jz "О сохранности не беспокойтесь, все ваши вещи будут храниться в защищённой ячейке."

    hide Jozeph with fade

    "Я снял свой костюм и противопар."
    "Меня немного насторожили слова Йозефа, поэтому я решил проверить ячейку лично."
    "Она была чем-то похожа на обычный сейф."
    "Убрав все свои вещи и закрыв ячейку на замок, я трижды проверил всё ли безопасно."
    "После чего убрал ключ и направился с Йозефом к воротам лаборатории."
    "Пока открывались ворота, я решил задать вопрос, который мучал меня ещё с момента входа."

    show Jozeph dark at jozpos

    g "Что это была за бумажка которую вы передали охраннику,{w} пропуск на моё имя?"
    g "Как вы могли знать приду ли я сегодня, да и вообще…?"

    show Jozeph normal at jozpos

    jz "Ну знаете, мы думали что вы просто не сможете отказаться от такого предложения."
    jz "Давайте отбросим формальности и вместе насладимся видом нашего замечательного комплекса Байстимер!"

    hide Jozeph

    "Когда ворота почти открылись, свет резко ударил мне в глаза так, что я почти ничего не видел."
    
    scene labinside
    with fade

    "Когда пелена спала, передо мной предстала не просто лаборатория, а целый небольшой город."
    "Даже слова Николы о том, что лаборатория это замечательное место, не могут сравниться с тем удивительным видом, что я наблюдаю сейчас."
    "Кажется, будто здесь никогда не было войны, как будто райский остров на выжженной земле."
    "Это иронично, ведь именно из-за этих земель и началась война."

    show Jozeph normal at jozpos

    jz "Сам комплекс находится под огромным стеклянным куполом, так что воздух здесь абсолютно чистый."
    jz "Здесь проживает около 100 семей, есть детские сады, школы, больницы, и различные досуговые заведения, начиная от детских площадок и заканчивая барами."
    jz "Выпускники колледжей сразу устраиваются сюда на работу."
    jz "А в дальнейшей перспективе хорошие работники могут попасть в столицу."
    jz "Это скорее общая информация, думаю вам будут интересны наши лабораторные корпуса."
    jz "Они пронумерованы с первого по пятый."
    jz "Теплицы для Эдема и других реагентов, корпуса массового производства жидкости и исследования новых, а также корпуса тестирования."
    jz "Мы являемся крупнейшим поставщиком Вапориса Амариллового на всём континенте."
    jz "Сейчас функционирует 4 теплицы общей площадью целых 12 гектар."
    jz "Также есть обычная теплица, в которой выращиваются различные сельско-хозяйственные культуры для обеспечения едой работников комплекса."

    show Jozeph dark at jozpos

    menu:
        "Можно как-то побыстрее":
            pass
        "Что дальше?":
            pass
    
    show Jozeph normal at jozpos

    jz "Не буду вас задерживать ещё больше, пройдёмте сразу к исследовательским лабораториям."

    scene black with fade
    hide Jozeph

    "Медленно последовав за Йозефом я продолжал осматриваться вокруг."
    "Мой взгляд тут же зацепился за детскую площадку, на которой непринуждённо резвились дети."
    "Абсолютно здоровые и счастливые, невидевшие мир за стеной.{w} И только воспитательница выглядела  немного уставшей на их фоне."
    "По моей спине проходит холодок, когда я понимаю, что эти два совершенно разных мира разделены всего лишь каменной стеной."
    "Хотел бы я также счастливо жить здесь?"

    menu:
        "Жить вместе с этими ублюдками под одной крышей, что может быть хуже?":
            pass
        "Я бы хотел, чтобы люди за стеной могли обрести такой же дом.":
            pass
    
    "Мои размышления внезапно прервал Йозеф."

    jz "Мы на месте, вы находитесь у корпуса массового производства."
    jz "Здесь создаётся паровая жидкость в большом объёме для поставок в столицу и соседние города."
    jz "Пройдёмте внутрь, посмотрим на производство поближе."
    "По внешнему виду эта лаборатория напоминала обычное ничем не примечательное здание с множеством труб на крыше уходящих за купол."
    "Йозеф достал из портфеля металлическую карточку которую он предъявлял на проходном пункте и поднёс рефлением к терминалу у двери."
    "После одобрительного писка дверь открылась. Внутри находился предпарник и абсолютно чистые парокостюмы в большом количестве."
    jz "Для входа в производственное помещение вам необходимо надеть этот парокостюм."
    jz "В своих лабораториях мы соблюдаем наивысшие меры стерильности."
    "Я немного замешкался, одеваясь в парокостюм."
    "Новые модели всё же отличаются от того в чём я пришёл."
    "Когда я закончил Йозеф уже был готов активировать процесс очистки."
    "Буквально несколько секунд, и мы уже могли пройти внутрь."

    scene corridor
    with fade

    "Перед нами был длинный коридор, с белыми стенами, потолком и полом."
    "Казалось, что ему нет конца."
    "Пройдя дальше, стены по правую сторону сменились на стеклянные, открывая вид на производство сверху."
    "Я увидел много людей в белых костюмах."
    "Одна часть занималась замешиванием реагентов в пробирках."
    "В то время как другая оценивала качество получившейся продукции."
    "Были и другие работники, которые занимались упаковкой товара в герметичные контейнеры."
    "Паровая жидкость в большей степени была зелёного цвета."
    "По запаху помещения и яркому оттенку я точно мог сказать, что это – лечебная парожидкость,{w} причём очень высокого класса."
    "Также небольшая часть пробирок была окрашена светлыми синими тонами."
    "Скорее всего, этот пар используют для дезинфекции ран."

    show Jozeph normal at jozpos

    jz "Перед вами наш главный производственный цех."
    jz "Мы используем только лучшие реагенты собственного производства, полученные из соседних корпусов."
    jz "Думаю вы и сами всё уже поняли."
    jz "Хотя Вапорис Амарилловый и считается редким растением, от него мы используем только лучшую часть – цветок."

    show Jozeph dark at jozpos

    g "А куда деваются стебли и корни?"

    show Jozeph normal at jozpos

    jz "Они либо перерабатываются, либо отправляются в утиль."

    show Jozeph dark at jozpos

    "Их расточительное обращение к Эдему просто поражает.{w} Хотя только благодаря их халатности я мог проводить свои собственные исследования."

    show Jozeph normal at jozpos

    jz "Что ж, не будем здесь задерживаться, пройдёмте в следующий корпус."
    jz "Можете не переживать, нам не придётся возвращаться обратно тем же путём."
    jz "Все корпуса связаны сетью мостовых каналов."

    hide Jozeph with fade

    "Чуть пройдя дальше, стеклянные стены снова сменились на белые."
    "После прохождения моста мы попали в другой корпус, хотя изнутри ничего не поменялось."
    "Всё такой же белый коридор, которому просто нет конца."
    "И снова по правой стороне показались стеклянные стены."

    show Jozeph normal at jozpos

    jz "Сейчас мы находимся в комплексе по исследованию и созданию совершенно новых парожидкостей."

    show Jozeph dark at jozpos

    "Количество столов по замешиванию реагентов значительно превышало то, что я видел ранее."
    "Работников здесь меньше, но они очень аккуратно смешивают содержимое пробирок."
    "У каждого стола своя вытяжка и свои реагенты."
    "Изготовленную жидкость подписывают и передают отдельному человеку, который собирает пробирки в коробку."
    "Я видел, как заполненные ящики куда-то увозили на тележке, но точно не мог знать куда."
    g "А что за парожидкости здесь производят?"

    show Jozeph normal at jozpos

    jz "Наши учёные пытаются внедрить пар в самые разные сферы человеческой жизни."
    jz "Таким образом, мы хотим улучшить жизнь жителей нашего государства."

    show Jozeph dark at jozpos

    g "А почему жидкости таких ядовитых цветов?"
    g "Часть пробирок содержат слишком много красного оттенка"
    g "Я сильно сомневаюсь, что такой пар предназначен для мирных целей"

    show Jozeph normal at jozpos

    jz "Извините, но моих знаний недостаточно, чтобы ответить на ваши вопросы{w}, я не парохимик."
    jz "Моя задача состоит в том, чтобы показать вам наш чудесный комплекс."
    jz "Я думаю, что вся жидкость производимая здесь сможет в будущем сильно помочь всем жителям нашего государства."

    show Jozeph dark at jozpos

    g "Прошу прощения, но это не ответ"

    init:
        $ right1 = Position(xalign=0.8, yalign=2.0)
        $ middle1 = Position(xalign=0.5, yalign=-1.0)
    
    show Jozeph dark at right1
    show Verner normal at middle1 with easeinleft

    x "Тогда может быть я смогу ответить на ваши вопросы?"

    show Jozeph normal at right1
    show Verner dark at middle1

    jz "Профессор Бауманн!"
    jz "Я даже не заметил как вы подошли."

    show Jozeph dark at right1
    show Verner dark at middle1

    "Этот мужчина появился совсем внезапно{w}, будто из ниоткуда."
    "По Йозефу было видно, что этот человек имеет здесь очень большую власть."

    show Verner normal at middle1

    x "Йозеф, дальше нашим гостем займусь я."
    x "Вы можете идти и заниматься своими дальнейшими поручениями."
    x "Доклад о проделанной вами работе жду сегодня вечером на своём столе."

    show Verner dark at middle1

    "По лицу Йозефа было откровенно видно, что он не рад такому стечению обстоятельств."

    show Jozeph normal at right1

    jz "Хорошо{w}, вас понял."

    hide Jozeph
    with fade

    "Йозеф развернулся в противоположном направлении и удалился от нас медленным шагом, сгорбив спину, будто от уныния."

    show Verner normal at middle1

    v "Разрешите представиться{w}, меня зовут Вернер Бауманн."
    v "Я являюсь ведущим специалистом и по совместительству начальником данного корпуса."
    "Передо мной стоял статный высокий мужчина в очках с полностью седыми волосами и абсолютно прямой осанкой."
    "Я сразу даже и не заметил, что на нём не было парокостюма."
    "Он был одет в стильный пиджак с лабораторным халатом поверх."
    v "Отвечая на ваш вопрос заданный Йозефу, производимая здесь парожидкость используется не только для мирных, но и для военных целей."

    show Verner dark at middle1

    g "Для войны с кем?"
    g "Вам не хватает тех ужасов, что происходят за стенами лаборатории?"
    g "Вы просто заперлись здесь и не выходите во внешний мир."

    show Verner normal at middle1

    v "Вообще-то я довольно часто посещаю столицу."

    show Verner dark at middle1

    "На его лице была видна очевидная насмешка."

    show Verner normal at middle1

    v "Вы же не хотите чтобы на нас вдруг внезапно напали?"
    v "Именно для подобных целей мы и создаём особые парожидкости."
    v "Если хотите более подробно обсудить это, то тогда пройдёмте в мой кабинет."

    show Verner dark at middle1

    "Думаю, стоит воспользоваться этой возможностью."
    "Всё же мне это интересно в первую очередь с научной точки зрения."
    g "Хорошо."

    show Verner normal at middle1

    v "Следуйте за мной."

    hide Verner with fade

    "Мы направились дальше по коридору и резко свернули налево на полпути."

    scene black with fade

    "Пройдя ещё немного, перед нами показалась большая дверь, которую охранял один человек, на поясе которого висело оружие."
    "Охранник отдал честь и быстрым движением распахнул дверь."

    scene office with fade
    show Verner normal at middle1 with fade

    v "Чувствуйте себя как дома, Гарретт"

    hide Verner with easeoutright

    "Кабинет выглядел очень статно."
    "В дальней части комнаты стоял письменный стол, а вблизи маленький кофейный столик с диванами по краям."
    "Стены были украшены грамотами и фотографиями."
    "Справа от письменного стола находился стеллаж с наградами и кубками."
    "Всё это освещало несколько окон с разных сторон."

    show Verner normal at middle1

    v "Присаживайтесь"

    show Verner dark at middle1

    "Вернер сел на один из диванов."
    "Я же разместился прямо напротив него."
    "Охранник, который стоял у двери, встал позади Бауманна."

    show Verner normal at middle1

    v "Вы знаете, Гарретт, я о вас наслышан."
    v "Никола Зелин рассказывал о вас и ваших навыках в пароварении."
    "В этот момент Вернер очень звонко щёлкнул пальцами."
    play sound finger

    show Verner dark at middle1

    "Тут же охранник подошел к рабочему столу и взял лежавшую на нём папку."
    "После чего вернулся и передал её Вернеру."

    show Verner normal at middle1

    v "Я очень трепетно отношусь к наёму сотрудников в свою лабораторию, поэтому стараюсь изучить о них всю возможную информацию."

    show Verner dark at middle1

    "На кофейном столике лежала папка, подписанная Г. Морган, с моей старой довоенной фотографией."
    g "Откуда у вас моё дело?"

    show Verner normal at middle1

    v "Мои уши есть везде."

    show Verner dark at middle1

    "Он сказал эту фразу будто наcмехаясь."
    "После чего медленно открыл папку и начал неторопливо листать."

    show Verner normal at middle1

    v "Я знаю то, что вы сражались на стороне Болимвера как парохимик 10 лет назад."
    v "А ещё я знаю что вы окончили государственный университет пароварения в Болимвере с отличием."
    v "У вас было перспективное будущее не начнись бы война."
    v "И несмотря на это вы всё равно продолжили свои исследования в области пара, это похвально."
    v "Многие, увидев последствия фиолетовой смерти, ужаснулись тому, насколько может быть опасен пар и ушли из науки."
    v "У вас сильный дух, стойкость военного и большой опыт, а также острый ум."
    v "Мне нужен такой сотрудник в мою лабораторию."

    show Verner dark at middle1

    g "Вы предлагаете мне изготавливать орудия для убийств?"
    g "Да я ни за что не пойду на это"

    show Verner normal at middle1

    v "Времена изменились."
    v "Сейчас нет слова не буду или не хочу."
    v "Сейчас есть только слово надо."
    v "Мы изготавливаем это не для того чтобы нападать, но чтобы защищаться."
    v "Если мы будем бездействовать, то когда-нибудь разработки, подобные нашим, применят уже на нас самих."

    show Verner dark at middle1

    g "Это всего лишь жалкие оправдания человека, который разрабатывает оружие и зарабатывает на нём"

    show Verner normal at middle1

    v "Я вас понял{w}, видимо мы с вами не сможем договориться."
    v "Я был лучшего о вас мнении."
    v "Я думал провести сегодня беседу с умным человеком, а в итоге общался с ребёнком, погрязшим в недостижимых идеалах."

    show Verner dark at middle1

    "Его голос с каждым разом повышался всё сильнее и сильнее."
    "Было видно, что не такого расклада он ожидал."

    show Verner normal at middle1

    v "Выведи его."

    hide Verner

    "Охраник подошёл ко мне и кивнул в направлении двери."
    "Прямо перед тем как закрыть дверь Вернер снова обратился ко мне."

    show Verner normal at middle1

    v "И ещё{w}, если вы всё же перестанете мыслить как малое дитя и передумаете{w}, я найду вам работу."

    hide Verner
    scene black with fade

    "Охранник захлопнул дверь с внешней стороны и пошёл по направлению к выходу, тем же путём что мы пришли с Йозефом."

    pause 2.0
    scene warehouse with fade

    "И вот спустя некоторое время я оказался в самом начале, в предпарнике всего комплекса."
    "Забрав свои вещи я переоделся, после чего охранник связался с диспетчером и покинул предпарник."
    "Через несколько минут открылись основные ворота и я снова вернулся в тот мир который помню последние 10 лет."
    "Выходя из ворот я услышал истошный мужской крик."

    init:
        $ manpos = Position(xalign=0.5, yalign=3.5)
    scene gates with fade
    show man normal at manpos

    x "Прошу, пожалуйста, верните меня назад."
    x "Скажите профессору Бауманну что я осознал свои ошибки."
    x "Дайте хотя бы взглянуть на моих детей."

    show man dark at manpos

    "Прямо перед одним из солдат на коленях стоял мужчина в лабораторном парокостюме как у Йозефа."
    "По его голосу было понятно, что он в отчаянии."
    "Мужчина буквально лез на этого солдата, пытаясь уцепиться за его одежду."
    "Не выдержав такой наглости, солдат резко ударил его прикладом в лицо с такой силой, что он аж отлетел."
    "На него тут же было направлено дуло винтовки."
    "Поняв, что ситуация критическая, я тут же подскочил."
    g "Стойте, не стреляйте!"
    "Абсолютно проигнорировав меня солдат сделал выстрел."

    show man normal at manpos

    x "МОЯ НОГА{w}, ААААААААААААААААААААААААААААААААААААА"

    hide man

    "Грязный белый костюм мужчины тут же окрасился в тёмно-красный." 
    "Я незамедлительно подбежал к раненному мужчине."
    "Его парокостюм был пробит в месте попадания пули, но не насквозь."
    "Нужно быстро предотвратить отравление тела паром."
    "У меня в сумке есть изолента, использую её, чтобы перебинтовать ногу."
    "Пока я всё это делал, мужчина уже потерял сознание."

    menu:
        "Что вы стоите как истуканы, пустите нас внутрь, иначе он умрёт":
            pass
        "Пожалуйста, пустите нас внутрь ненадолго, он в критическом состоянии":
            pass
    
    x "Не положено."
    "Голос доносился из окошка охранника."
    "Он был ясным и чётким, без какой либо доли сомнения."
    "Я понимал, что пройти внутрь нам не дадут."
    "Единственным выходом было донести его до моей лаборатории."
    "Путь стоял неблизкий, но медлить нельзя, на кону жизнь этого человека."

    scene black with fade

    "*Прошел один час*"

    scene market with dissolve

    g "Торговая площадь, наконец-то."
    g "Мужик, ты там живой или нет?"

    pause 1.0

    "В ответ тишина."
    "Надеюсь, что он ещё жив."
    "Я и не думал, что нести его будет настолько тяжело."
    "Такими темпами он умрёт ещё на полпути."
    g "Кто-нибудь, помогите, здесь человек умирает."
    "Никто даже не обратил на нас внимания."
    "Глупо было ожидать, что алчные до денег торговцы помогут простому человеку."

    menu:
        "Значит, придётся делать всё самому.":
            pass
        "Кажется, я уже не смогу спасти его.":
            pass
    
    "Болтая с самим собой, я и не заметил, как к нам подошла кучка детей."
    g "Простите дети, мне больше нечего вам дать"
    "Дети" "Дяденька, может быть вам нужна помощь?"
    "Внезапно к нам подошли дети постарше с тележкой в руках."
    "Выглядели они хуже младших, но держались очень стойко."
    "Ребята постарше" "Грузите его сюда."
    "Они буквально выхватили его с моего плеча и аккуратно положили на тележку."
    "Ребята постарше" "Мы видели, как вы помогли нашим младшим, и решили отплатить вам тем же."
    "Я был поражён их поступку."
    "Дети, которые остались ни с чем, смогли помочь кому-то другому."
    "Пара юношей взялась за тележку и ждала моих указаний"
    g "Его нужно быстро отвезти в мою лабораторию!"
    "Ребята постарше" "Будет сделано!"

    scene black with fade

    "Мы тут же отправились в путь."
    "Зачастую я даже не поспевал за ними."
    "С такими обширными ранами по всему телу они оставались на удивление очень энергичными."
    "Таким образом, мы в кратчайший срок добрались прямо до моего дома."
    "Находясь у моей лаборатории, они взяли этого мужчину на руки и донесли прямо до предпарника."
    g "Подождите меня немного здесь"
    "Я не хотел отпускать этих детей с пустыми руками после всего того что они для меня сделали."
    "Я постарался максимально быстро войти внутрь и взять несколько пробирок с лечебным паром для них."
    "Через несколько минут я вышел с парожидкостью в руках и протянул её детям."
    g "Вот, возьмите, это меньшее чем я могу отплатить вам за вашу помощь"
    "По их лицам было видно, что они не собирались брать с меня что-то за помощь."
    "Но понимая, что на площади есть дети, кому приходится ещё хуже, чем им, они забрали пробирки."
    "Откланявшись, юноши поспешили удалиться."
    "Зайдя в предпарник и закрыв за собой дверь, я немедленно снял с мужчины всю одежду после очистки."

    scene lab with fade

    "Донеся его до койки, я принялся за осмотр ран."
    "Он потерял много крови, его кожа была слегка бледной, также были видны признаки множественного отравления организма."
    "Рана всё ещё немного кровоточила."
    "Негативные процессы можно успеть остановить пока не стало слишко поздно."
    "Одного лечебного пара здесь будет мало, для начала нужно провести дезинфекцию."
    "Без моего старого кадила здесь не обойтись."
    "Поставив его на разогрев, я сел за свой стол и начал замешивать реагенты."

    scene black with fade
    centered "Создаём пазл...{nw}"
    $ grid_width = 4
    $ grid_height = 6
    $ chosen_img = "minigame/minigame3.png"

    call puzzle from _call_puzzle_2
    scene lab with fade

    g "Готово{w}, лишь бы успеть"
    "К этому моменту кадило достаточно прогрелось, чтобы им можно было пользоваться."
    "Влив синюю жидкость я начал постепенно обрабатывать паром тело мужчины."
    "Реакция организма не заставила себя ждать."
    "От такой боли мужчина тут же очнулся и стал неистово кричать."
    x "АААААААААААААААААААААААААААААААААААААААААААААААААА"
    "Я не представляю насколько сильную боль он чувствовал в этот момент, но это просто необходимая мера."
    "От такого сильного всплеска боли он снова упал в обморок и больше не приходил в сознание."
    "Закончив обработку синим паром, я принялся вливать в кадило зелёную парожидкость."
    "Смесь моих реагентов не сможет дать мгновенных видимых эффектов лечения, но определённо подействует."
    "Когда всё было готово, я внёс последние штрихи, окончательно перебинтовав его рану на ноге."
    "Убрав кадило в сторону я сел за свой стол."
    "Столь интенсивный и волнительный день не мог не отразиться на мне."
    "От общей усталости я почти мгновенно провалился в сон..."

    scene war2  with Fade(3.0, 0.5, 3.0)

    "Вдалеке раздавались крики."
    "Я взял бинокль чтобы увидеть что происходило у крепости."
    "Люди, выбегавшие из клубов фиолетового пара, больше напоминали ходячие куски мяса." 
    "С них очень быстро слезала кожа{w}, скорее всего это происходило из-за странного фиолетового пара, другого предположить я не могу."
    "Я быстро ринулся к медицинской палатке и начал искать любую одежду, которая могла бы меня защитить."
    "В глаза тут же бросился антиинфекционный костюм."
    "Быстро надев его, я вышел из палатки."
    "Нужно найти какой-то транспорт и поскорее сбежать отсюда."
    "По пути я наткнулся на обречённого бедолагу."
    "Он стоял на коленях с опущенными руками и лицом, онемевшим от страха."
    "Я понимал, что никто кроме меня его не спасёт."
    "Я привёл его в чувство и дал план действий."
    "Через некоторое время он вернулся одетым в такой же антиинфекционный костюм, как и я."
    "Теперь нам вместе нужно понять, как бы поскорее выбраться из этого ада..."

    play sound lock volume 0.7
    pause 0.5

    scene lab

    "Какой-то щелчок резко меня разбудил{w}, наверное, это почтовый затвор."
    g "Мои парочасы остановились, сколько я проспал?"
    "Ещё одним удивлением для меня был тот факт, что человек, которого я лечил, куда-то пропал."
    "Окинув взглядом свой стол я увидел записку."

    scene hletter with fade

    g "Ясно{w}, вот оно что"

    scene lab

    "Наверное, стоит осмотреть комнату, вдруг он что-то мог украсть."

    scene lab with Fade(0.5, 1.5, 0.5)

    "Вроде как ничего не пропало.{w} Вот только мой моток изоленты значительно убавил в размерах."
    "В процессе я совсем забыл о том, что меня разбудил затвор почтового ящика."
    "Думаю нужно проверить что там."
    "Зайдя в прихожую, я обнаружил на полу письмо."
    "Вернувшись в комнату, я сел за стол и вскрыл его."

    scene nletter with fade
    pause 10.0

    "Никола не стал бы отправлять письмо если бы это было что-то не срочное и не важное."
    scene lab with fade
    "У меня ещё остались реагенты, думаю стоит сделать несколько парожидкостей на всякий случай"


    scene black with fade
    centered "Создаём пазл...{nw}"
    $ grid_width = 6
    $ grid_height = 8
    $ chosen_img = "minigame/minigame4.png"

    call puzzle from _call_puzzle_3

    scene lab with fade
    g "Думаю этого будет достаточно"

    play sound door
    pause 2.3
    scene lab

    "Внезапный стук в дверь отвлёк меня."
    "Кто это может быть?"
    "Никола уже давно в столице, надо быть начеку."

    g "Входите"

    "Я подбежал к двери и заглянул в глазок."
    "В предпарнике стоял человек в лабораторном парокостюме."

    g "Что вам нужно?"
    x "Не бойтесь, это я, пришёл вас отблагодарить"

    "Спустя некоторое время этот человек вошёл ко мне в комнату."

    scene lab with fade

    transform helpos:
        xalign 0.5 yalign -0.5
        zoom 1.5

    show Helmut normal at helpos

    x "Хочу ещё раз сказать вам спасибо за то, что спасли меня"
    "Похоже что это мой пациент, но почему он так внезапно пропал и также внезапно появился здесь?"

    show Helmut dark at helpos

    g "Почему вы ушли?"

    show Helmut normal at helpos

    x "Как только пар подействовал, я почувствовал облегчение и ко мне вернулись силы"
    x "Мне срочно нужно было вернуться домой и увидеть свою семью"
    x "Ах да, я забыл представиться"
    h "Меня зовут Хельмут Борген, я был ученым в лаборатории"
    h "Сейчас я с ней никак не связан, потому что меня оттуда выгнали"

    show Helmut dark at helpos

    g "А в чем собственно была причина?"

    show Helmut normal at helpos

    h "Долго рассказывать, мне нужно спешить, я должен срочно увезти свою семью из города пока торговцы ещё здесь"
    h "В благодарность за спасение я хочу оставить вам свой старый лабораторный костюм"
    h "Я его немного подлатал, лишним он вам точно не будет"

    show Helmut dark at helpos

    g "Ну...{w} Спасибо"

    show Helmut normal at helpos

    h "Удачи вам{w}, я пойду"

    hide Helmut with fade

    "Хельмут поспешно удалился из моей лаборатории."
    "Осмотрев костюм, что он мне отдал, я наконец-то понял, куда пропала моя изолента."
    "Пускай костюм не в лучшем состоянии, но его можно использовать."
    "Итак{w}, что же мне делать дальше?"
    "Судя по письму Николы, Бауманн так просто меня не оставит, наверное мне тоже стоит уехать."
    
    menu:
        "Думаю, оставаться здесь на ещё какое-то неопределённое время будет опасно, надо уходить":
            jump escape
        "Сначала мне нужно понять действительно ли за меня серьёзно взялись. Останусь здесь ещё на пару дней":
            jump soldier_caught
    
label soldier_caught:

    scene black with Fade(2.0, 0.0, 0.0)

    "Пару дней спустя..."

    scene lab with Fade(0.0, 0.0, 2.0)

    "В мою дверь внезапно постучали."
    "Хельмут что-то забыл?"
    "Тут же дверь резко открылась."

    show Soldier normal at joepos

    x "Гаррет Морган? Бауманн хочет кое-что с вами обсудить"

    pause 1.5

    g "Вот чёрт..."

    scene black with Fade(1.0, 0.0, 0.0)

    "Двое вооружённых солдат забрали Гаррета с собой. Сбежать ему никак не удастся. Его дальнейшая судьба неизвестна..."

    scene end with Fade(1.0, 0.0, 1.5)
    pause 1.5
    
    "Похоже что это конец вашего приключения"
    "Вы можете оставить всё как есть или попробовать изменить своё решение"
    "Нажмите для возвращения в главное меню"
    return

label escape:
    "Я должен взять с собой всё самое необходимое."
    "Джо ещё должен быть в городе. Надеюсь, он поможет мне сбежать."
    "В лаборатории меня уже видели, мой старый костюм могут опознать на пограничном пункте."
    "Старый костюм Хельмута поможет мне замаскироваться."
    "Осталось только собрать все вещи."

    scene black with fade

    "Спустя некоторое время…"

    scene market with Fade(0.0, 0.0, 1.5)

    "Мне нужно найти Джо. Думаю он будет там же где и в прошлый раз."

    scene market with Fade(0.5, 1.0, 0.5)

    show Joe normal at joepos

    jo "Здравствуйте, могу вам чем-то помочь?"

    show Joe dark at joepos

    g "Джо, это я, Гаррет, мне нужна твоя помощь"

    show Joe normal at joepos

    jo "Морган?{w} Почему ты в лабораторном парокостюме? Решил плясать под дудку Бауманна?"

    show Joe dark at joepos

    g "Долго рассказывать, мне нужно срочно уехать из города"

    show Joe normal at joepos

    jo "Тебе несказанно повезло! Как раз сегодня я и хотел вернуться в столицу"

    show Joe dark at joepos

    g "Спасибо, Джо"

    show Joe normal at joepos

    jo "Погоди, погоди, ты же не думаешь, что я буду делать это за просто так?"

    show Joe dark at joepos

    g "Чего ты хочешь взамен?"

    show Joe normal at joepos

    jo "Я помню ты мне рассказывал про некий ПВН"
    jo "Он меня так заинтересовал, но ты решил не делиться рецептом"

    show Joe dark at joepos

    g "Хорошо, так и быть, я дам тебе рецепт, только увези меня отсюда"

    show Joe normal at joepos

    jo "Наконец-то мы с тобой нашли общий язык, Гаррет!"
    jo "Я отбываю через 30 минут, можешь пока залезать в багажник и складывать свои вещи"

    hide Joe
    scene trackbox with Fade(1.0, 0.0, 0.5)
    
    "Внутри багажника уже были люди. Всего их было четверо: женщина, взрослый мужчина и два ребёнка"

    pause 0.5
    show Jozeph normal at helpos

    x "Гаррет, это ты?"
    x "Узнал тебя по моему старому костюму! Ты все таки решил его надеть"

    show Jozeph dark at helpos

    g "Хельмут? Ты знаком с Джо?"

    show Jozeph normal at helpos

    h "Я иногда закупал у него различные жидкости, у Джо один из самых богатых ассортиментов на торговой площади"

    show Jozeph dark at helpos

    g "Вот оно что, значит мы поедем вместе"

    show Jozeph normal at helpos
    pause 0.5

    jo "Народ, мы выезжаем!"
    jo "Если кто-то что-то забыл, я не виноват"

    scene trackbox with fade
    hide Jozeph

    "Спустя несколько секунд машина резко тронулась."
    "Насколько я понимаю, путь лежит неблизкий."
    "Наверное, стоит подумать о том, что я буду делать, когда прибуду в столицу."
    "Но меня не покидает ощущение, что Хельмут сверлит меня взглядом с тех пор, как только я сел в машину."

    pause 2.0
    show Jozeph normal at helpos

    h "Вы ведь что-то там натворили в лаборатории, я прав?"

    show Jozeph dark at helpos

    g "А что, по мне так сильно видно?"

    show Jozeph normal at helpos

    h "Просто я не думал, что вам тоже срочно нужно уезжать"

    show Jozeph dark at helpos

    g "Как я понял, мой отказ очень сильно оскорбил Бауманна"

    show Jozeph normal at helpos

    h "Он хотел взять вас на работу?"

    show Jozeph dark at helpos

    g "Я не хочу быть причастным к созданию оружия"
    g "Я своими глазами видел, как мучительно гибнут люди"
    g "Бауманн говорит, что времена изменились, но это всё лишь оправдания своих действий"

    show Jozeph normal at helpos

    h "Вам очень повезло, Гаррет. Вы вольны сами выбирать свою судьбу"
    h "Куда пойти, что делать, как зарабатывать на жизнь"
    h "Моя судьба уже была определена с рождения"
    h "Родители направили меня в научную школу"
    h "Школа распределила меня на факультет парохимии"
    h "После университета меня направили в столичный филиал лаборатории где я познакомился со своей супругой"
    h "Потом я был переведён сюда в комплекс Байстимер"
    h "Понимаете меня, Гаррет?{w} Во всех важных событиях в моей жизни не было ни одного моего собственного решения"
    h "Даже выгнали меня не из-за моей ошибки, я просто попал под горячую руку"

    show Jozeph dark at helpos

    menu:
        "У вас очень тяжёлая судьба":
            $ flag = False
            show Jozeph normal at helpos

            h "Такую судьбу я создал сам своим бездействием"
            h "Теперь, когда я за это поплатился, я сам буду решать свою судьбу поступками и действиями."

            hide Jozeph
        "Какой же ты жалкий человек":
            $ flag = True
            show Jozeph normal at helpos

            h "...{w}"

            scene trackbox with fade
            hide Jozeph
        "Во всем виновата эта прогнившая система":
            $ flag = False
            show Jozeph normal at helpos

            h "Такую судьбу я создал сам своим бездействием"
            h "Теперь, когда я за это поплатился, я сам буду решать свою судьбу поступками и действиями."

            hide Jozeph
    
    "На этом наш диалог закончился."
    "В оставшееся время поездки мы оба не проронили ни слова."

    scene black with fade

    "Спустя какое-то время..."

    scene trackbox with fade

    jo "Народ, внимание, впереди пограничный пункт, готовьтесь к проверке!"
    "Проверка? Нужно было заранее это обдумать."
    "Я должен как-то обмануть пограничников, но как?"

    pause 0.5

    "Машина резко остановилась, кто-то подошёл к багажнику и распахнул шторы."
    x "С какой целью вы покидаете город?"

    show Jozeph normal at jozpos

    h "Я парохимик из комплекса Байстимер. Меня и мою семью переводят в столичный филиал"

    show Jozeph dark at jozpos

    x "Почему вы покидаете город не через корпоративный трансфер?"

    show Jozeph normal at jozpos

    h "Из-за внезапной суматохи в комплексе наш трансфер был отменён, но наша дата перевода не была изменена"
    h "В связи с этим наше выселение из комплекса также не было отменено"
    h "Нам пришлось воспользоваться услугами торговца"

    show Jozeph dark at jozpos

    x "Да, я вас понимаю, у меня к вам вопросов больше нет"

    hide Jozeph

    x "А вы? Вам тоже отменили трансфер?"
    "Вот чёрт, теперь он обращается ко мне."
    "Нужно соврать иначе меня не пропустят."
    g "Да, к сожалению мой трансфер также был отменён"

    if flag:
        show Jozeph normal at jozpos

        h "Это не правда, он лжёт, я его впервые вижу, он не из комплекса!"

        hide Jozeph

        x "Вы должны пройти со мной, выйдите из машины"

        pause 1.0

        "Кажется у меня проблемы..."

        scene black with Fade(1.0, 0.0, 0.0)

        "Гаррета повели на досмотр и в конце концов опознали. Он был отправлен в комплекс Байстимер. Его дальнейшая судьба неизвестна..."

        scene end with Fade(1.0, 0.0, 1.5)
        pause 1.5

        "Кажется ваше приключение подошло к концу"
        "Довольно глупо было грубить простому человеку"
        "Вы можете оставить всё как есть или попробовать изменить своё решение"
        "Нажмите для возвращения в главное меню"
        return

    show Jozeph normal at jozpos

    h "Да, мой коллега также оказался в подобной ситуации"
    h "Его родственники ждут его прибытия в столицу"

    hide Jozeph

    x "Что ж они вас так, будто бросили на произвол судьбы"
    x "Хорошей вам дороги!"

    scene trackbox with fade

    "Пограничник закрыл штору после чего мы двинулись дальше."

    show Jozeph dark at helpos

    g "Спасибо, Хельмут, что прикрыл меня"

    show Jozeph normal at helpos

    h "Это я должен вас благодарить{w}, наконец-то я впервые в жизни принял решение сам!"

    hide Jozeph

    "Путь стоял неблизкий."
    "Мы едем уже несколько часов." 
    "Думаю, стоит немного отдохнуть..."
    
    scene black with Fade(3.0, 0.5, 3.0)
    return